Here I perform data manipulation so that I can easily make them into a dashboard to give summary fo the data.<br>
To do so, first need to look at which features it has.<br>
This Kaggle Data Science Job Salaries Dataset contains 11 columns, each are: <br>
<br>
1. work_year: The year the salary was paid.
2. experience_level: The experience level in the job during the year
3. employment_type: The type of employment for the role
4. job_title: The role worked in during the year.
5. salary: The total gross salary amount paid.
6. salary_currency: The currency of the salary paid as an ISO 4217 currency code.
7. salaryinusd: The salary in USD
8. employee_residence: Employee's primary country of residence in during the work year as an ISO 3166 country code.
9. remote_ratio: The overall amount of work done remotely
10. company_location: The country of the employer's main office or contracting branch
11. company_size: The median number of people that worked for the company during the year

Now we now which columns we have, we need to import necessary libraries for data transformation/cleaning

In [1]:
# import libraries
import numpy as np
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# load dataset
df = pd.read_csv('/Users/wootaekkim/Desktop/youtube learning/ds_salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [3]:
df.tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

## Understanding Data

Get a general information about the imported dataset.

In [4]:
df.info()
# there are total of 3755 data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

From above we can see that we do not have any missing values. Now we further explore each variables. <br>
Categorize each columns as qualitative and quantitaive variables.

In [5]:
numeric = ['int64']
not_numeric = ['object']
quantitative = []
qualitative = []

for col in df.columns:
    if df[col].dtype in numeric:
        quantitative.append(col)
    else:
        qualitative.append(col)

print('number of qualitative features: ', len(qualitative))
print('qualitative features are: ',qualitative)
print('number of quantitative features: ', len(quantitative))
print('quantitative features are: ',quantitative)

number of qualitative features:  7
qualitative features are:  ['experience_level', 'employment_type', 'job_title', 'salary_currency', 'employee_residence', 'company_location', 'company_size']
number of quantitative features:  4
quantitative features are:  ['work_year', 'salary', 'salary_in_usd', 'remote_ratio']

In [6]:
# check unqiue values of quantitative and qualitative variables
# first qualitative variables
for col in qualitative:
    print('number of unique entries of ', col,': ', len(df[col].unique()))
    print(' ')
    print('unique entries of ', col,': ')
    print(df[col].unique())
    print('_____________________________________________________________')

number of unique entries of  experience_level :  4

unique entries of  experience_level :
['SE' 'MI' 'EN' 'EX']
_____________________________________________________________
number of unique entries of  employment_type :  4

unique entries of  employment_type :
['FT' 'CT' 'FL' 'PT']
_____________________________________________________________
number of unique entries of  job_title :  93

unique entries of  job_title :
['Principal Data Scientist' 'ML Engineer' 'Data Scientist'
 'Applied Scientist' 'Data Analyst' 'Data Modeler' 'Research Engineer'
 'Analytics Engineer' 'Business Intelligence Engineer'
 'Machine Learning Engineer' 'Data Strategist' 'Data Engineer'
 'Computer Vision Engineer' 'Data Quality Analyst'
 'Compliance Data Analyst' 'Data Architect'
 'Applied Machine Learning Engineer' 'AI Developer' 'Research Scientist'
 'Data Analytics Manager' 'Business Data Analyst' 'Applied Data Scientist'
 'Staff Data Analyst' 'ETL Engineer' 'Data DevOps Engineer' 'Head of Data'
 'Data Science Manager' 'Data Manager' 'Machine Learning Researcher'
 'Big Data Engineer' 'Data Specialist' 'Lead Data Analyst'
 'BI Data Engineer' 'Director of Data Science'
 'Machine Learning Scientist' 'MLOps Engineer' 'AI Scientist'
 'Autonomous Vehicle Technician' 'Applied Machine Learning Scientist'
 'Lead Data Scientist' 'Cloud Database Engineer' 'Financial Data Analyst'
 'Data Infrastructure Engineer' 'Software Data Engineer' 'AI Programmer'
 'Data Operations Engineer' 'BI Developer' 'Data Science Lead'
 'Deep Learning Researcher' 'BI Analyst' 'Data Science Consultant'
 'Data Analytics Specialist' 'Machine Learning Infrastructure Engineer'
 'BI Data Analyst' 'Head of Data Science' 'Insight Analyst'
 'Deep Learning Engineer' 'Machine Learning Software Engineer'
 'Big Data Architect' 'Product Data Analyst'
 'Computer Vision Software Engineer' 'Azure Data Engineer'
 'Marketing Data Engineer' 'Data Analytics Lead' 'Data Lead'
 'Data Science Engineer' 'Machine Learning Research Engineer'
 'NLP Engineer' 'Manager Data Management' 'Machine Learning Developer'
 '3D Computer Vision Researcher' 'Principal Machine Learning Engineer'
 'Data Analytics Engineer' 'Data Analytics Consultant'
 'Data Management Specialist' 'Data Science Tech Lead'
 'Data Scientist Lead' 'Cloud Data Engineer' 'Data Operations Analyst'
 'Marketing Data Analyst' 'Power BI Developer' 'Product Data Scientist'
 'Principal Data Architect' 'Machine Learning Manager'
 'Lead Machine Learning Engineer' 'ETL Developer' 'Cloud Data Architect'
 'Lead Data Engineer' 'Head of Machine Learning' 'Principal Data Analyst'
 'Principal Data Engineer' 'Staff Data Scientist' 'Finance Data Analyst']
_____________________________________________________________
number of unique entries of  salary_currency :  20

unique entries of  salary_currency :
['EUR' 'USD' 'INR' 'HKD' 'CHF' 'GBP' 'AUD' 'SGD' 'CAD' 'ILS' 'BRL' 'THB'
 'PLN' 'HUF' 'CZK' 'DKK' 'JPY' 'MXN' 'TRY' 'CLP']
_____________________________________________________________
number of unique entries of  employee_residence :  78

unique entries of  employee_residence :
['ES' 'US' 'CA' 'DE' 'GB' 'NG' 'IN' 'HK' 'PT' 'NL' 'CH' 'CF' 'FR' 'AU'
 'FI' 'UA' 'IE' 'IL' 'GH' 'AT' 'CO' 'SG' 'SE' 'SI' 'MX' 'UZ' 'BR' 'TH'
 'HR' 'PL' 'KW' 'VN' 'CY' 'AR' 'AM' 'BA' 'KE' 'GR' 'MK' 'LV' 'RO' 'PK'
 'IT' 'MA' 'LT' 'BE' 'AS' 'IR' 'HU' 'SK' 'CN' 'CZ' 'CR' 'TR' 'CL' 'PR'
 'DK' 'BO' 'PH' 'DO' 'EG' 'ID' 'AE' 'MY' 'JP' 'EE' 'HN' 'TN' 'RU' 'DZ'
 'IQ' 'BG' 'JE' 'RS' 'NZ' 'MD' 'LU' 'MT']
_____________________________________________________________
number of unique entries of  company_location :  72

unique entries of  company_location :
['ES' 'US' 'CA' 'DE' 'GB' 'NG' 'IN' 'HK' 'NL' 'CH' 'CF' 'FR' 'FI' 'UA'
 'IE' 'IL' 'GH' 'CO' 'SG' 'AU' 'SE' 'SI' 'MX' 'BR' 'PT' 'RU' 'TH' 'HR'
 'VN' 'EE' 'AM' 'BA' 'KE' 'GR' 'MK' 'LV' 'RO' 'PK' 'IT' 'MA' 'PL' 'AL'
 'AR' 'LT' 'AS' 'CR' 'IR' 'BS' 'HU' 'AT' 'SK' 'CZ' 'TR' 'PR' 'DK' 'BO'
 'PH' 'BE' 'ID' 'EG' 'AE' 'LU' 'MY' 'HN' 'JP' 'DZ' 'IQ' 'CN' 'NZ' 'CL'
 'MD' 'MT']
_____________________________________________________________
number of unique entries of  company_size :  3

unique entries of  company_size :
['L' 'S' 'M']
_____________________________________________________________

## Data Transformation

Make Data Science related position titles into four categories for better insights

In [7]:
analyst =[] # data analyst, buisnes analyst, BI developer
data_scientist = [] # data scientist, data head, data lead, AI scientiest,3D Computer Vision Researcher
engineer = [] # any job title including engineer, data architect, ETL developer, data modeler
developer = []

for job in df['job_title'].unique():
    if 'Scientist' in job:
        data_scientist.append(job)
    elif 'Data Science' in job:
        data_scientist.append(job)
    elif job in ['AI Programmer', 'Head of Data', 'Autonomous Vehicle Technician','Data Strategist',
                 'Data Manager', 'Data Lead', 'Head of Machine Learning', 'Machine Learning Manager',
                'Data Specialist']:
        data_scientist.append(job)
    elif 'Analyst' in job:
        analyst.append(job)
    elif 'Analytics' in job:
        analyst.append(job)
    elif  'Engineer' in job:
        engineer.append(job)
    elif job in ['Data Management Specialist','Manager Data Management', 'Data Modeler']:
        engineer.append(job)
    elif 'Developer' in job:
        developer.append(job)
    elif 'Architect' in job:
        developer.append(job)
    elif 'Researcher' in job:
        developer.append(job)

Create a new column called 'job_category' showing category of job for each position title of each data.

In [8]:
#create new column using above classification
df['job_category'] = np.zeros(len(df))
for i in range(len(df)):
    if df['job_title'][i] in analyst:
        df['job_category'][i] = 'Analyst'
    elif df['job_title'][i] in data_scientist:
        df['job_category'][i] = 'Data Scientist'
    elif df['job_title'][i] in engineer:
        df['job_category'][i] = 'Data Engineer'
    elif df['job_title'][i] in developer:
        df['job_category'][i] = 'Developer/Researcher'

/var/folders/cy/j205pskx0zx83x7sz14l4jhw0000gn/T/ipykernel_75209/309917671.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['job_category'][i] = 'Data Scientist'

experience_level:

- SE: Senior
- EX: Executive
- MI: Mid Level
- EN: Entry Level

employment_type:

- FT: Full-time
- PT: Part-time
- CT: Contractor
- FL: Freelancer

Then, change experience level and employment type as above to make it easier to see on the visualization.

In [9]:
exp_lev = {'SE' : 'Senior', 'EX': 'Executive', 'MI' : 'Mid Level', 'EN' : 'Entry Level'}
emp_type = {'FT' : 'Full-time', 'PT' : 'Part-time', 'CT' : 'Contractor', 'FL' : 'Freelancer'}

df['experience_level'].replace(exp_lev, inplace=True)
df['employment_type'].replace(emp_type, inplace=True)

Check if above worked well

In [10]:
print(df['experience_level'].unique())
print(df['employment_type'].unique())

['Senior' 'Mid Level' 'Entry Level' 'Executive']
['Full-time' 'Contractor' 'Freelancer' 'Part-time']

Now change country code to country name. <br>
To do so, make them into a dictionary. I used https://www.iban.com/country-codes for reference.

In [11]:
country_dict = {'ES':'Spain','US':'United States', 'CA':'Canada', 'DE':'Germany','GB':'United Kingdom',
                'NG':'Nigeria', 'IN':'India', 'HK':'Hong Kong', 'PT':'Portugal','NL':'Netherlands', 
                'CH':'Switzerland', 'CF':'Central African Republic', 'FR':'France', 'AU': 'Australia',
                'FI':'Finland', 'UA':'Ukraine', 'IE':'Ireland', 'IL':'Israel', 'GH':'Ghana', 'AT':'Austria',
                'CO':'Colombia', 'SG':'Singapore', 'SE':'Sweden', 'SI':'Slovenia', 'MX':'Mexico', 'UZ':'Uzbekistan',
                'BR':'Brazil', 'TH':'Thailand', 'HR': 'Croatia', 'PL':'Poland', 'KW':'Kuwait', 'VN':'Viet Nam',
                'CY':'Cyprus', 'AR':'Argentina', 'AM':'Armenia', 'BA':'Bosnia and Herzegovina', 'KE':'Kenya',
                'GR':'Greece', 'MK':'Macedonia', 'LV':'Latvia', 'RO':'Romania', 'PK':'Pakistan', 'IT':'Italy',
                'MA':'Morocco', 'LT':'Lithuania', 'BE':'Belgium', 'AS':'American Samoa', 'IR':'Iran', 
                'HU':'Hungary', 'SK':'Slovakia', 'CN':'China', 'CZ':'Czech Republic', 'CR':'Costa Rica', 
                'TR':'Turkey', 'CL':'Chile', 'PR':'Puerto Rico', 'DK':'Denmark', 'BO':'Bolivia',
                'PH':'Philippines', 'DO':'Dominican Republic', 'EG':'Egypt', 'ID':'Indonesia', 'AE':'United Arab Emirates',
                'MY':'Malaysia', 'JP':'Japan', 'EE':'Estonia', 'HN':'Honduras', 'TN':'Tunisia', 'RU':'Russian Federation',
                'DZ':'Algeria', 'IQ':'Iraq', 'BG':'Bulgaria', 'JE':'Jersey', 'RS':'Serbia', 'NZ':'New Zealand',
                'MD':'Moldova, Republic of', 'LU':'Luxembourg', 'MT':'Malta','AL':'Albania','BS':'Bahamas'}

In [12]:
df['company_location'].replace(country_dict, inplace=True)
df['employee_residence'].replace(country_dict, inplace=True)

In [13]:
df['company_location'].unique()

array(['Spain', 'United States', 'Canada', 'Germany', 'United Kingdom',
       'Nigeria', 'India', 'Hong Kong', 'Netherlands', 'Switzerland',
       'Central African Republic', 'France', 'Finland', 'Ukraine',
       'Ireland', 'Israel', 'Ghana', 'Colombia', 'Singapore', 'Australia',
       'Sweden', 'Slovenia', 'Mexico', 'Brazil', 'Portugal',
       'Russian Federation', 'Thailand', 'Croatia', 'Viet Nam', 'Estonia',
       'Armenia', 'Bosnia and Herzegovina', 'Kenya', 'Greece',
       'Macedonia', 'Latvia', 'Romania', 'Pakistan', 'Italy', 'Morocco',
       'Poland', 'Albania', 'Argentina', 'Lithuania', 'American Samoa',
       'Costa Rica', 'Iran', 'Bahamas', 'Hungary', 'Austria', 'Slovakia',
       'Czech Republic', 'Turkey', 'Puerto Rico', 'Denmark', 'Bolivia',
       'Philippines', 'Belgium', 'Indonesia', 'Egypt',
       'United Arab Emirates', 'Luxembourg', 'Malaysia', 'Honduras',
       'Japan', 'Algeria', 'Iraq', 'China', 'New Zealand', 'Chile',
       'Moldova, Republic of', 'Malta'], dtype=object)

In [14]:
df['employee_residence'].unique()

array(['Spain', 'United States', 'Canada', 'Germany', 'United Kingdom',
       'Nigeria', 'India', 'Hong Kong', 'Portugal', 'Netherlands',
       'Switzerland', 'Central African Republic', 'France', 'Australia',
       'Finland', 'Ukraine', 'Ireland', 'Israel', 'Ghana', 'Austria',
       'Colombia', 'Singapore', 'Sweden', 'Slovenia', 'Mexico',
       'Uzbekistan', 'Brazil', 'Thailand', 'Croatia', 'Poland', 'Kuwait',
       'Viet Nam', 'Cyprus', 'Argentina', 'Armenia',
       'Bosnia and Herzegovina', 'Kenya', 'Greece', 'Macedonia', 'Latvia',
       'Romania', 'Pakistan', 'Italy', 'Morocco', 'Lithuania', 'Belgium',
       'American Samoa', 'Iran', 'Hungary', 'Slovakia', 'China',
       'Czech Republic', 'Costa Rica', 'Turkey', 'Chile', 'Puerto Rico',
       'Denmark', 'Bolivia', 'Philippines', 'Dominican Republic', 'Egypt',
       'Indonesia', 'United Arab Emirates', 'Malaysia', 'Japan',
       'Estonia', 'Honduras', 'Tunisia', 'Russian Federation', 'Algeria',
       'Iraq', 'Bulgaria', 'Jersey', 'Serbia', 'New Zealand',
       'Moldova, Republic of', 'Luxembourg', 'Malta'], dtype=object)

## Exporting Data

Now export the dataframe as csv for visaulization on Tableau

In [15]:
df.to_csv('/Users/wootaekkim/Desktop/youtube learning/ds_salary_tableau.csv')